//
//  Api.h
//  AirCnCWallet
//
//  Created by Mars on 2018/1/24.
//  Copyright © 2018年 AirCnC车去车来. All rights reserved.
//
//                            _ooOoo_
//                           o8888888o
//                           88" . "88
//                           (| -_- |)
//                            O\ = /O
//                        ____/`---'\____
//                      .   ' \\| |// `.
//                       / \\||| : |||// \
//                     / _||||| -:- |||||- \
//                       | | \\\ - /// | |
//                     | \_| ''\---/'' | |
//                      \ .-\__ `-` ___/-. /
//                   ___`. .' /--.--\ `. . __
//                ."" '< `.___\_<|>_/___.' >'"".
//               | | : `- \`.;`\ _ /`;.`/ - ` : | |
//                 \ \ `-. \_ __\ /__ _/ .-` / /
//         ======`-.____`-.___\_____/___.-`____.-'======
//                            `=---='
//
//         .............................................
//                  佛祖镇楼                  BUG辟易
//          佛曰:
//                  写字楼里写字间，写字间里程序员；
//                  程序人员写程序，又拿程序换酒钱。
//                  酒醒只在网上坐，酒醉还来网下眠；
//                  酒醉酒醒日复日，网上网下年复年。
//                  但愿老死电脑间，不愿鞠躬老板前；
//                  奔驰宝马贵者趣，公交自行程序员。
//                  别人笑我忒疯癫，我笑自己命太贱；
//                  不见满街漂亮妹，哪个归得程序员？


#ifndef Api_h
#define Api_h

//  测试服务器
//#define AppApi @"http://192.168.0.211:8072" //测试地址
//#define AppImage @"http://192.168.0.211:8087"  //前缀测试
//#define AppImage2 @"http://192.168.0.211:8083"  //前缀测试

//  生产服务器
#define AppApi @"https://webapp-api.aircnc.com.cn" //生产服务器
#define AppImage @"https://img2.aircnc.com.cn"  //前缀测试  系统
#define AppImage2 @"https://img1.aircnc.com.cn"  //前缀测试 是用户

#define Api @"newapi/" //接口



#endif /* Api_h */
